In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Load the data
routes_df = pd.read_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\Lombardia GTFS\AltriGestori\routes.txt")
trips_df = pd.read_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\Lombardia GTFS\AltriGestori\trips.txt")
stop_times_df = pd.read_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\Lombardia GTFS\AltriGestori\stop_times.txt")
stops_df = pd.read_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\Lombardia GTFS\AltriGestori\stops.txt")

## Regional Bus

In [ ]:
bus_routes = routes_df[routes_df["route_type"] == 3]

In [ ]:
bus_trips = trips_df[trips_df["route_id"].isin(bus_routes['route_id'])]

In [ ]:
bus_stop_time=stop_times_df[stop_times_df['trip_id'].isin(bus_trips['trip_id'])]

In [ ]:
bus_stops=bus_stop_time[bus_stop_time['stop_id'].isin(stops_df['stop_id'])]

In [ ]:
s=stops_df[stops_df['stop_id'].isin(bus_stops['stop_id'])]

In [ ]:
s.drop_duplicates(subset='stop_id', keep='last')

In [ ]:
s.to_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\PhD\Mapping\ABC\ABC-model-18-02-2024\regional_bus.csv")

## Tram

In [3]:
tram_routes = routes_df[routes_df["route_type"] == 0]

In [4]:
tram_routes

     route_id route_short_name route_long_name  agency_id  route_type
755      3625               T1              T1         45           0

In [5]:
tram_trips= trips_df[trips_df["route_id"].isin(tram_routes['route_id'])]

In [6]:
tram_trips

        route_id  service_id   trip_id
111617      3625       91707  43532960
111618      3625       91707  43532963
111619      3625       91707  43532964
111620      3625       91707  43533127
111621      3625       91707  43533128
...          ...         ...       ...
141902      3625       91722  43542580
141903      3625       91722  43542581
141904      3625       91722  43543219
141905      3625       91722  43543248
141906      3625       91722  43543249

[2304 rows x 3 columns]

In [7]:
tram_stop_time=stop_times_df[stop_times_df['trip_id'].isin(tram_trips['trip_id'])]

In [8]:
tram_stop_time

          trip_id  stop_id  stop_sequence arrival_time departure_time
2879449  43511970    48439              1     19:34:00       19:34:00
2879450  43511970    48440              2     19:36:00       19:36:00
2879451  43511970    48441              3     19:37:00       19:37:00
2879452  43511970    48442              4     19:38:00       19:38:00
2879453  43511970    48443              5     19:40:00       19:40:00
...           ...      ...            ...          ...            ...
3648299  43543358    48442              4     07:37:00       07:37:00
3648300  43543358    48443              5     07:39:00       07:39:00
3648301  43543358    48444              6     07:41:00       07:41:00
3648302  43543358    48445              7     07:42:00       07:42:00
3648303  43543358    48446              8     07:44:00       07:44:00

[34080 rows x 5 columns]

In [9]:
tram_stops= stops_df[stops_df["stop_id"].isin(tram_stop_time['stop_id'])]

In [11]:
tram_stops.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 15795 to 15830
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   stop_id    30 non-null     int64
 1   stop_code  30 non-null     object
 2   stop_name  30 non-null     object
 3   stop_desc  30 non-null     object
 4   stop_lat   30 non-null     float64
 5   stop_lon   30 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.6+ KB

In [12]:
tram_stops.to_csv(r"D:\15_Polimi\Polimi_onedrive\OneDrive - Politecnico di Milano\PhD\Mapping\ABC\ABC-model-18-02-2024\regionaltram.csv")